stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_usart.c
/*!**************************************************************************
    @file stm32f1x3_usart.c
    @brief Source file for stm32f103 USART
    @author Stuart Ianna
    @version 1.0
    @date May 2018
    @copyright GNU GPLv3
    @warning None
    @bug The USART.get() function is not compatible when using ISRs. This is becuase the data register needs to be read to reset the flags. This cannot be efficiently done in both ISR and get function. This is not a large problem as the get function is blocking, and isn't really used with an ISR.

    @details
    @par Verified Compilers
    - arm-none-eabi-gcc (15:4.9.3+svn231177-1) 4.9.3 20150529 (prerelease)
******************************************************************************/

#include "stm32f1x3_usart.h"

/****************************************************************************/
//				USART1
/****************************************************************************/

//ISR function pointers 
static void (*usart1_isr_rx)(uint8_t c);
static void (*usart1_isr_tx)(void);

//USART1 routines
static uint8_t usart1_set_baud(uint8_t baud);
static uint8_t usart1_set_stop(uint8_t stop);
static uint8_t usart1_set_parity(uint8_t parity);
static uint8_t usart1_set_data(uint8_t data);
static uint8_t usart1_setup(void);
static void    usart1_default_rx_isr(uint8_t byte);
static void    usart1_default_tx_isr(void);
static void    usart1_put(uint8_t c);
static uint8_t usart1_get(void);

/****************************************************************************/
//				USART2
/****************************************************************************/

//ISR function pointers 
static void (*usart2_isr_rx)(uint8_t c);
static void (*usart2_isr_tx)(void);

//USART1 routines
static uint8_t usart2_set_baud(uint8_t baud);
static uint8_t usart2_set_stop(uint8_t stop);
static uint8_t usart2_set_parity(uint8_t parity);
static uint8_t usart2_set_data(uint8_t data);
static uint8_t usart2_setup(void);
static void    usart2_default_rx_isr(uint8_t byte);
static void    usart2_default_tx_isr(void);
static void    usart2_put(uint8_t c);
static uint8_t usart2_get(void);

/****************************************************************************/
//				USART3
/****************************************************************************/

//ISR function pointers 
static void (*usart3_isr_rx)(uint8_t c);
static void (*usart3_isr_tx)(void);

//USART1 routines
static uint8_t usart3_set_baud(uint8_t baud);
static uint8_t usart3_set_stop(uint8_t stop);
static uint8_t usart3_set_parity(uint8_t parity);
static uint8_t usart3_set_data(uint8_t data);
static uint8_t usart3_setup(void);
static void    usart3_default_rx_isr(uint8_t byte);
static void    usart3_default_tx_isr(void);
static void    usart3_put(uint8_t c);
static uint8_t usart3_get(void);

/****************************************************************************/
//			     SETUP FUNCTIONS
/****************************************************************************/

mcu_error USART_setup(usart_periph peripheral){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			//Direct the ISR routines
			USART_setTxISR (peripheral, usart1_default_tx_isr);
			USART_setRxISR (peripheral, usart1_default_rx_isr);

			//Setup the port
			usart1_setup();
			break;

		case USART_2:

			//Direct the ISR routines
			USART_setTxISR (peripheral, usart2_default_tx_isr);
			USART_setRxISR (peripheral, usart2_default_rx_isr);

			//Setup the port
			usart2_setup();
			break;

		case USART_3:

			//Direct the ISR routines
			USART_setTxISR (peripheral, usart3_default_tx_isr);
			USART_setRxISR (peripheral, usart3_default_rx_isr);

			//Setup the port
			usart3_setup();
			break;
		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}

	return error;
}

mcu_error usart1_setup(void){

	uint8_t error = E_USART_NOERROR;

	//Setup the GPIO pins
	pinSetup(GPIO_UART_RX,PORTA,PIN10);
	pinSetup(GPIO_UART_TX,PORTA,PIN9);

	//Enable USART CLOCK
    rcc_periph_clock_enable(RCC_USART1);

	//Set default settings
	usart1_set_parity(USART_DEFAULT_PARITY);
	usart1_set_data(USART_DEFAULT_DATA);
	usart1_set_stop(USART_DEFAULT_STOP);
	usart1_set_baud(USART_DEFAULT_BAUD);

	//Enable receive 
	USART_CR1(USART1) |= USART_CR1_RE;

	//Enable receive interrupts
	USART_CR1(USART1) |= USART_CR1_RXNEIE;

	USART_DR(USART1)= 0;

	//Enable transmit interrupts
	USART_CR1(USART1) |= USART_CR1_TCIE;

	//Enable transmit 
	USART_CR1(USART1) |= USART_CR1_TE;

	//Enable USART1
	USART_CR1(USART1) |= USART_CR1_UE;

	//Enable interrupts
    nvic_enable_irq(NVIC_USART1_IRQ);

	return error;
}

mcu_error usart2_setup(void){

	uint8_t error = E_USART_NOERROR;

	//Setup the GPIO pins
	pinSetup(GPIO_UART_RX,PORTA,PIN3);
	pinSetup(GPIO_UART_TX,PORTA,PIN2);

	//Enable USART CLOCK
    rcc_periph_clock_enable(RCC_USART2);

	//Set default settings
	usart2_set_parity(USART_DEFAULT_PARITY);
	usart2_set_data(USART_DEFAULT_DATA);
	usart2_set_stop(USART_DEFAULT_STOP);
	usart2_set_baud(USART_DEFAULT_BAUD);

	//Enable receive 
	USART_CR1(USART2) |= USART_CR1_RE;

	//Enable receive interrupts
	USART_CR1(USART2) |= USART_CR1_RXNEIE;

	USART_DR(USART2)= 0;

	//Enable transmit interrupts
	USART_CR1(USART2) |= USART_CR1_TCIE;

	//Enable transmit 
	USART_CR1(USART2) |= USART_CR1_TE;

	//Enable USART1
	USART_CR1(USART2) |= USART_CR1_UE;

	//Enable interrupts
    nvic_enable_irq(NVIC_USART2_IRQ);

	return error;
}

mcu_error usart3_setup(void){

	uint8_t error = E_USART_NOERROR;

	//Setup the GPIO pins
	pinSetup(GPIO_UART_RX,PORTB,PIN11);
	pinSetup(GPIO_UART_TX,PORTB,PIN10);

	//Enable USART CLOCK
    rcc_periph_clock_enable(RCC_USART3);

	//Set default settings
	usart3_set_parity(USART_DEFAULT_PARITY);
	usart3_set_data(USART_DEFAULT_DATA);
	usart3_set_stop(USART_DEFAULT_STOP);
	usart3_set_baud(USART_DEFAULT_BAUD);

	//Enable receive 
	USART_CR1(USART3) |= USART_CR1_RE;

	//Enable receive interrupts
	USART_CR1(USART3) |= USART_CR1_RXNEIE;

