stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_usart.c
	USART_DR(USART3)= 0;

	//Enable transmit interrupts
	USART_CR1(USART3) |= USART_CR1_TCIE;

	//Enable transmit 
	USART_CR1(USART3) |= USART_CR1_TE;

	//Enable USART1
	USART_CR1(USART3) |= USART_CR1_UE;

	//Enable interrupts
    nvic_enable_irq(NVIC_USART3_IRQ);

	return error;
}

/****************************************************************************/
//			     BAUD FUNCTIONS
/****************************************************************************/

mcu_error USART_setBaud(usart_periph peripheral, usart_baud baud){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			usart1_set_baud(baud);
			break;

		case USART_2:

			usart2_set_baud(baud);
			break;

		case USART_3:

			usart3_set_baud(baud);
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	
	return error;

}

mcu_error usart1_set_baud(usart_baud baud){

	uint8_t error = E_USART_NOERROR;

	switch(baud){

		case USART_BAUD_2400:

            usart_set_baudrate(USART1,2400);
			break;

		case USART_BAUD_4800:

            usart_set_baudrate(USART1,4800);
			break;

		case USART_BAUD_9600:

            usart_set_baudrate(USART1,9600);
			break;

		case USART_BAUD_19200:

            usart_set_baudrate(USART1,19200);
			break;

		case USART_BAUD_38400:

            usart_set_baudrate(USART1,38400);
			break;

		case USART_BAUD_57600:
            usart_set_baudrate(USART1,57600);
			break;

		case USART_BAUD_115200:

            usart_set_baudrate(USART1,115200);
			break;
		default:
			error = E_USART_NOBAUD;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOBAUD);
			}
			break;

	}

	return error;
}

mcu_error usart2_set_baud(usart_baud baud){

	uint8_t error = E_USART_NOERROR;
	
	switch(baud){

		case USART_BAUD_2400:

            usart_set_baudrate(USART2,2400);
			break;

		case USART_BAUD_4800:

            usart_set_baudrate(USART2,4800);
			break;

		case USART_BAUD_9600:

            usart_set_baudrate(USART2,9600);
			break;

		case USART_BAUD_19200:

            usart_set_baudrate(USART2,19200);
			break;

		case USART_BAUD_38400:

            usart_set_baudrate(USART2,38400);
			break;

		case USART_BAUD_57600:
            usart_set_baudrate(USART2,57600);
			break;

		case USART_BAUD_115200:

            usart_set_baudrate(USART2,115200);
			break;
		default:
			error = E_USART_NOBAUD;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOBAUD);
			}
			break;

	}

	return error;
}

mcu_error usart3_set_baud(usart_baud baud){

	uint8_t error = E_USART_NOERROR;
	
	switch(baud){

		case USART_BAUD_2400:

            usart_set_baudrate(USART3,2400);
			break;

		case USART_BAUD_4800:

            usart_set_baudrate(USART3,4800);
			break;

		case USART_BAUD_9600:

            usart_set_baudrate(USART3,9600);
			break;

		case USART_BAUD_19200:

            usart_set_baudrate(USART3,19200);
			break;

		case USART_BAUD_38400:

            usart_set_baudrate(USART3,38400);
			break;

		case USART_BAUD_57600:
            usart_set_baudrate(USART3,57600);
			break;

		case USART_BAUD_115200:

            usart_set_baudrate(USART3,115200);
			break;
		default:
			error = E_USART_NOBAUD;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOBAUD);
			}
			break;

	}

	return error;
}
/****************************************************************************/
//			     STOP FUNCTIONS
/****************************************************************************/

mcu_error USART_setStop(usart_periph peripheral, usart_stop stop){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			usart1_set_stop(stop);
			break;

		case USART_2:

			usart2_set_stop(stop);
			break;

		case USART_3:

			usart3_set_stop(stop);
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	
	return error;

}

mcu_error usart1_set_stop(usart_stop stop){

	uint8_t error = E_USART_NOERROR;

	switch(stop){

		case USART_STOP_ONE:

            usart_set_stopbits(USART1,USART_STOPBITS_1);
			break;

		case USART_STOP_TWO:

            usart_set_stopbits(USART1,USART_STOPBITS_2);
			break;

		default:
			error = E_USART_NOSTOP;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOSTOP);
			}
			break;
	}

	return error;
}

mcu_error usart2_set_stop(usart_stop stop){

	uint8_t error = E_USART_NOERROR;

	switch(stop){

		case USART_STOP_ONE:

            usart_set_stopbits(USART2,USART_STOPBITS_1);
			break;

		case USART_STOP_TWO:

            usart_set_stopbits(USART2,USART_STOPBITS_2);
			break;

		default:
			error = E_USART_NOSTOP;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOSTOP);
			}
			break;
	}

	return error;
}

mcu_error usart3_set_stop(usart_stop stop){

	uint8_t error = E_USART_NOERROR;

	switch(stop){

		case USART_STOP_ONE:

            usart_set_stopbits(USART3,USART_STOPBITS_1);
			break;

		case USART_STOP_TWO:

            usart_set_stopbits(USART3,USART_STOPBITS_2);
			break;

		default:
			error = E_USART_NOSTOP;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOSTOP);
			}
			break;
	}

	return error;
}

/****************************************************************************/
//			     DATA FUNCTIONS
/****************************************************************************/

mcu_error USART_setData(usart_periph peripheral,usart_data data){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){
		case USART_1:

			usart1_set_data(data);
			break;

		case USART_2:

			usart2_set_data(data);
			break;

		case USART_3:

			usart3_set_data(data);
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	
	return error;
}

mcu_error usart1_set_data(usart_data data){

	uint8_t error = E_USART_NOERROR;

	switch(data){

		case USART_DATA_EIGHT:

            usart_set_databits(USART1,8);
			break;

		case USART_DATA_NINE:

            usart_set_databits(USART1,9);
			break;

		default:
			error = E_USART_NODATA;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NODATA);
			}
			break;

