stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_usart.c
			usart2_isr_tx = new_handler;
			break;

		case USART_3:

			usart3_isr_tx = new_handler;
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	return error;
}

mcu_error USART_disableISR (usart_periph peripheral, usart_isr isr_target){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			
			if(USART_RX == isr_target){

				//Disable receive interrupts
				USART_CR1(USART1) &= ~USART_CR1_RXNEIE;
			}
			else if(USART_TX == isr_target){

				//Disable transmit interrupts
				USART_CR1(USART1) &= ~USART_CR1_TCIE;
				USART_CR1(USART1) &= ~USART_CR1_TXEIE;

			}
			else{
				error = E_USART_NOINT;
			}

			//Disable interrupts
            nvic_disable_irq(NVIC_USART1_IRQ);
			break;

		case USART_2:

			
			if(USART_RX == isr_target){

				//Disable receive interrupts
				USART_CR1(USART2) &= ~USART_CR1_RXNEIE;
			}
			else if(USART_TX == isr_target){

				//Disable transmit interrupts
				USART_CR1(USART2) &= ~USART_CR1_TCIE;
				USART_CR1(USART2) &= ~USART_CR1_TXEIE;

			}
			else{
				error = E_USART_NOINT;
			}

			//Disable interrupts
            nvic_disable_irq(NVIC_USART2_IRQ);
			break;

		case USART_3:

			
			if(USART_RX == isr_target){

				//Disable receive interrupts
				USART_CR1(USART3) &= ~USART_CR1_RXNEIE;
			}
			else if(USART_TX == isr_target){

				//Disable transmit interrupts
				USART_CR1(USART3) &= ~USART_CR1_TCIE;
				USART_CR1(USART3) &= ~USART_CR1_TXEIE;

			}
			else{
				error = E_USART_NOINT;
			}

			//Disable interrupts
            nvic_disable_irq(NVIC_USART3_IRQ);
			break;

		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}

	return error;


}

mcu_error USART_enableISR (usart_periph peripheral, usart_isr isr_target){

	uint8_t error = E_USART_NOERROR;

	switch(peripheral){

		case USART_1:

			if(USART_RX == isr_target){

				//Clear the data register to stop inital interrupts
				USART_DR(USART1) = 0;

				//Enable receive interrupts
				USART_CR1(USART1) |= USART_CR1_RXNEIE;

				//Enable interrupts
                nvic_enable_irq(NVIC_USART1_IRQ);
			}
			else if(USART_TX == isr_target){

				//Clear the data register to stop inital interrupts
				USART_DR(USART1) = 0;

				//Enable transmit interrupts
				USART_CR1(USART1) |= USART_CR1_TCIE;

				//Enable interrupts
				nvic_enable_irq(NVIC_USART1_IRQ);

			}
			else{
				error = E_USART_NOINT;
			}
			break;

		case USART_2:

			if(USART_RX == isr_target){

				//Clear the data register to stop inital interrupts
				USART_DR(USART2) = 0;

				//Enable receive interrupts
				USART_CR1(USART2) |= USART_CR1_RXNEIE;

				//Enable interrupts
                nvic_enable_irq(NVIC_USART2_IRQ);
			}
			else if(USART_TX == isr_target){

				//Clear the data register to stop inital interrupts
				USART_DR(USART2) = 0;

				//Enable transmit interrupts
				USART_CR1(USART2) |= USART_CR1_TCIE;

				//Enable interrupts
				nvic_enable_irq(NVIC_USART2_IRQ);

			}
			else{
				error = E_USART_NOINT;
			}
			break;

		case USART_3:

			if(USART_RX == isr_target){

				//Clear the data register to stop inital interrupts
				USART_DR(USART3) = 0;

				//Enable receive interrupts
				USART_CR1(USART3) |= USART_CR1_RXNEIE;

				//Enable interrupts
                nvic_enable_irq(NVIC_USART3_IRQ);
			}
			else if(USART_TX == isr_target){

				//Clear the data register to stop inital interrupts
				USART_DR(USART3) = 0;

				//Enable transmit interrupts
				USART_CR1(USART3) |= USART_CR1_TCIE;

				//Enable interrupts
				nvic_enable_irq(NVIC_USART3_IRQ);

			}
			else{
				error = E_USART_NOINT;
			}
			break;



		default:
			error =  E_USART_NOPORT;

			if(MCU_debugIsEnabled()){
				MCU_printError(E_USART_NOPORT);
			}
			break;
	}
	return error;

}

/****************************************************************************/
//		         	ISRs
/****************************************************************************/

void usart1_isr (void)
{
	//Check if called because of RXNE. 
	if (((USART_CR1(USART1) & USART_CR1_RXNEIE) != 0) && ((USART_SR(USART1) & USART_SR_RXNE) != 0)) {

		usart1_isr_rx(USART_DR(USART1));
	}

	// Check if called because of TXE. 
	if (((USART_CR1(USART1) & USART_CR1_TCIE) != 0) && ((USART_SR(USART1) & USART_SR_TC) != 0)) {

		USART_SR(USART1) &= ~USART_SR_TC;
		usart1_isr_tx();
	}
}

void usart2_isr (void)
{
	//Check if called because of RXNE. 
	if (((USART_CR1(USART2) & USART_CR1_RXNEIE) != 0) && ((USART_SR(USART2) & USART_SR_RXNE) != 0)) {

		usart2_isr_rx(USART_DR(USART2));
	}

	// Check if called because of TXE. 
	if (((USART_CR1(USART2) & USART_CR1_TCIE) != 0) && ((USART_SR(USART2) & USART_SR_TC) != 0)) {

		USART_SR(USART2) &= ~USART_SR_TC;
		usart2_isr_tx();
	}
}

void usart3_isr (void)
{
	//Check if called because of RXNE. 
	if (((USART_CR1(USART3) & USART_CR1_RXNEIE) != 0) && ((USART_SR(USART3) & USART_SR_RXNE) != 0)) {

		usart3_isr_rx(USART_DR(USART3));
	}

	// Check if called because of TXE. 
	if (((USART_CR1(USART3) & USART_CR1_TCIE) != 0) && ((USART_SR(USART3) & USART_SR_TC) != 0)) {

		USART_SR(USART3) &= ~USART_SR_TC;
		usart3_isr_tx();
	}
}

/****************************************************************************/
//		           DEFAULT ISR
/****************************************************************************/

void usart1_default_rx_isr(uint8_t c){

	//This exists to catch un-implemented ISR calls
    c++;

}

void usart1_default_tx_isr(void){

	//This exists to catch un-implemented ISR calls

}

void usart2_default_rx_isr(uint8_t c){

	//This exists to catch un-implemented ISR calls
    c++;

}

void usart2_default_tx_isr(void){

	//This exists to catch un-implemented ISR calls

}

void usart3_default_rx_isr(uint8_t c){

	//This exists to catch un-implemented ISR calls
    c++;

}

void usart3_default_tx_isr(void){

	//This exists to catch un-implemented ISR calls

}

